MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DX256ZVMD10/mcu.h
#define PDB0_SC                       (*((volatile uint32_t *)0x40036000))      // Status and Control Register (PDB0_SC)
#define PDB0_MOD                      (*((volatile uint32_t *)0x40036004))      // Modulus Register (PDB0_MOD)
#define PDB0_CNT                      (*((volatile uint32_t *)0x40036008))      // Counter Register (PDB0_CNT)
#define PDB0_IDLY                     (*((volatile uint32_t *)0x4003600C))      // Interrupt Delay Register (PDB0_IDLY)
#define PDB0_CH0C1                    (*((volatile uint32_t *)0x40036010))      // Channel n Control Register 1 (PDB0_CH0C1)
#define PDB0_CH0S                     (*((volatile uint32_t *)0x40036014))      // Channel n Status Register (PDB0_CH0S)
#define PDB0_CH0DLY0                  (*((volatile uint32_t *)0x40036018))      // Channel n Delay 0 Register (PDB0_CH0DLY0)
#define PDB0_CH0DLY1                  (*((volatile uint32_t *)0x4003601C))      // Channel n Delay 1 Register (PDB0_CH0DLY1)
#define PDB0_CH1C1                    (*((volatile uint32_t *)0x40036038))      // Channel n Control Register 1 (PDB0_CH1C1)
#define PDB0_CH1S                     (*((volatile uint32_t *)0x4003603C))      // Channel n Status Register (PDB0_CH1S)
#define PDB0_CH1DLY0                  (*((volatile uint32_t *)0x40036040))      // Channel n Delay 0 Register (PDB0_CH1DLY0)
#define PDB0_CH1DLY1                  (*((volatile uint32_t *)0x40036044))      // Channel n Delay 1 Register (PDB0_CH1DLY1)
#define PDB0_DACINTC0                 (*((volatile uint32_t *)0x40036150))      // DAC Interval Trigger n Control Register (PDB0_DACINTC0)
#define PDB0_DACINT0                  (*((volatile uint32_t *)0x40036154))      // DAC Interval n Register (PDB0_DACINT0)
#define PDB0_DACINTC1                 (*((volatile uint32_t *)0x40036158))      // DAC Interval Trigger n Control Register (PDB0_DACINTC1)
#define PDB0_DACINT1                  (*((volatile uint32_t *)0x4003615C))      // DAC Interval n Register (PDB0_DACINT1)
#define PDB0_PO0EN                    (*((volatile uint32_t *)0x40036190))      // Pulse-Out n Enable Register (PDB0_PO0EN)
#define PDB0_PO0DLY                   (*((volatile uint32_t *)0x40036194))      // Pulse-Out n Delay Register (PDB0_PO0DLY)


//*****************************************************************************
//
// FlexTimer (FTM) registers
//
//*****************************************************************************

#define FTM0_SC                       (*((volatile uint32_t *)0x40038000))      // Status and Control (FTM0_SC)
#define FTM0_CNT                      (*((volatile uint32_t *)0x40038004))      // Counter (FTM0_CNT)
#define FTM0_MOD                      (*((volatile uint32_t *)0x40038008))      // Modulo (FTM0_MOD)
#define FTM0_C0SC                     (*((volatile uint32_t *)0x4003800C))      // Channel (n) Status and Control (FTM0_C0SC)
#define FTM0_C0V                      (*((volatile uint32_t *)0x40038010))      // Channel (n) Value (FTM0_C0V)
#define FTM0_C1SC                     (*((volatile uint32_t *)0x40038014))      // Channel (n) Status and Control (FTM0_C1SC)
#define FTM0_C1V                      (*((volatile uint32_t *)0x40038018))      // Channel (n) Value (FTM0_C1V)
#define FTM0_C2SC                     (*((volatile uint32_t *)0x4003801C))      // Channel (n) Status and Control (FTM0_C2SC)
#define FTM0_C2V                      (*((volatile uint32_t *)0x40038020))      // Channel (n) Value (FTM0_C2V)
#define FTM0_C3SC                     (*((volatile uint32_t *)0x40038024))      // Channel (n) Status and Control (FTM0_C3SC)
#define FTM0_C3V                      (*((volatile uint32_t *)0x40038028))      // Channel (n) Value (FTM0_C3V)
#define FTM0_C4SC                     (*((volatile uint32_t *)0x4003802C))      // Channel (n) Status and Control (FTM0_C4SC)
#define FTM0_C4V                      (*((volatile uint32_t *)0x40038030))      // Channel (n) Value (FTM0_C4V)
#define FTM0_C5SC                     (*((volatile uint32_t *)0x40038034))      // Channel (n) Status and Control (FTM0_C5SC)
#define FTM0_C5V                      (*((volatile uint32_t *)0x40038038))      // Channel (n) Value (FTM0_C5V)
#define FTM0_C6SC                     (*((volatile uint32_t *)0x4003803C))      // Channel (n) Status and Control (FTM0_C6SC)
#define FTM0_C6V                      (*((volatile uint32_t *)0x40038040))      // Channel (n) Value (FTM0_C6V)
#define FTM0_C7SC                     (*((volatile uint32_t *)0x40038044))      // Channel (n) Status and Control (FTM0_C7SC)
#define FTM0_C7V                      (*((volatile uint32_t *)0x40038048))      // Channel (n) Value (FTM0_C7V)
#define FTM0_CNTIN                    (*((volatile uint32_t *)0x4003804C))      // Counter Initial Value (FTM0_CNTIN)
#define FTM0_STATUS                   (*((volatile uint32_t *)0x40038050))      // Capture and Compare Status (FTM0_STATUS)
#define FTM0_MODE                     (*((volatile uint32_t *)0x40038054))      // Features Mode Selection (FTM0_MODE)
#define FTM0_SYNC                     (*((volatile uint32_t *)0x40038058))      // Synchronization (FTM0_SYNC)
#define FTM0_OUTINIT                  (*((volatile uint32_t *)0x4003805C))      // Initial State for Channels Output (FTM0_OUTINIT)
#define FTM0_OUTMASK                  (*((volatile uint32_t *)0x40038060))      // Output Mask (FTM0_OUTMASK)
#define FTM0_COMBINE                  (*((volatile uint32_t *)0x40038064))      // Function for Linked Channels (FTM0_COMBINE)
#define FTM0_DEADTIME                 (*((volatile uint32_t *)0x40038068))      // Deadtime Insertion Control (FTM0_DEADTIME)
#define FTM0_EXTTRIG                  (*((volatile uint32_t *)0x4003806C))      // FTM External Trigger (FTM0_EXTTRIG)
#define FTM0_POL                      (*((volatile uint32_t *)0x40038070))      // Channels Polarity (FTM0_POL)
#define FTM0_FMS                      (*((volatile uint32_t *)0x40038074))      // Fault Mode Status (FTM0_FMS)
#define FTM0_FILTER                   (*((volatile uint32_t *)0x40038078))      // Input Capture Filter Control (FTM0_FILTER)
#define FTM0_FLTCTRL                  (*((volatile uint32_t *)0x4003807C))      // Fault Control (FTM0_FLTCTRL)
#define FTM0_QDCTRL                   (*((volatile uint32_t *)0x40038080))      // Quadrature Decoder Control and Status (FTM0_QDCTRL)
#define FTM0_CONF                     (*((volatile uint32_t *)0x40038084))      // Configuration (FTM0_CONF)
#define FTM0_FLTPOL                   (*((volatile uint32_t *)0x40038088))      // FTM Fault Input Polarity (FTM0_FLTPOL)
#define FTM0_SYNCONF                  (*((volatile uint32_t *)0x4003808C))      // Synchronization Configuration (FTM0_SYNCONF)
#define FTM0_INVCTRL                  (*((volatile uint32_t *)0x40038090))      // FTM Inverting Control (FTM0_INVCTRL)
#define FTM0_SWOCTRL                  (*((volatile uint32_t *)0x40038094))      // FTM Software Output Control (FTM0_SWOCTRL)
#define FTM0_PWMLOAD                  (*((volatile uint32_t *)0x40038098))      // FTM PWM Load (FTM0_PWMLOAD)
#define FTM1_SC                       (*((volatile uint32_t *)0x40039000))      // Status and Control (FTM1_SC)
#define FTM1_CNT                      (*((volatile uint32_t *)0x40039004))      // Counter (FTM1_CNT)
#define FTM1_MOD                      (*((volatile uint32_t *)0x40039008))      // Modulo (FTM1_MOD)
#define FTM1_C0SC                     (*((volatile uint32_t *)0x4003900C))      // Channel (n) Status and Control (FTM1_C0SC)
#define FTM1_C0V                      (*((volatile uint32_t *)0x40039010))      // Channel (n) Value (FTM1_C0V)
#define FTM1_C1SC                     (*((volatile uint32_t *)0x40039014))      // Channel (n) Status and Control (FTM1_C1SC)
#define FTM1_C1V                      (*((volatile uint32_t *)0x40039018))      // Channel (n) Value (FTM1_C1V)
#define FTM1_C2SC                     (*((volatile uint32_t *)0x4003901C))      // Channel (n) Status and Control (FTM1_C2SC)
#define FTM1_C2V                      (*((volatile uint32_t *)0x40039020))      // Channel (n) Value (FTM1_C2V)
#define FTM1_C3SC                     (*((volatile uint32_t *)0x40039024))      // Channel (n) Status and Control (FTM1_C3SC)
#define FTM1_C3V                      (*((volatile uint32_t *)0x40039028))      // Channel (n) Value (FTM1_C3V)
#define FTM1_C4SC                     (*((volatile uint32_t *)0x4003902C))      // Channel (n) Status and Control (FTM1_C4SC)
#define FTM1_C4V                      (*((volatile uint32_t *)0x40039030))      // Channel (n) Value (FTM1_C4V)
#define FTM1_C5SC                     (*((volatile uint32_t *)0x40039034))      // Channel (n) Status and Control (FTM1_C5SC)
#define FTM1_C5V                      (*((volatile uint32_t *)0x40039038))      // Channel (n) Value (FTM1_C5V)
#define FTM1_C6SC                     (*((volatile uint32_t *)0x4003903C))      // Channel (n) Status and Control (FTM1_C6SC)
#define FTM1_C6V                      (*((volatile uint32_t *)0x40039040))      // Channel (n) Value (FTM1_C6V)
#define FTM1_C7SC                     (*((volatile uint32_t *)0x40039044))      // Channel (n) Status and Control (FTM1_C7SC)
#define FTM1_C7V                      (*((volatile uint32_t *)0x40039048))      // Channel (n) Value (FTM1_C7V)
#define FTM1_CNTIN                    (*((volatile uint32_t *)0x4003904C))      // Counter Initial Value (FTM1_CNTIN)
#define FTM1_STATUS                   (*((volatile uint32_t *)0x40039050))      // Capture and Compare Status (FTM1_STATUS)
#define FTM1_MODE                     (*((volatile uint32_t *)0x40039054))      // Features Mode Selection (FTM1_MODE)
#define FTM1_SYNC                     (*((volatile uint32_t *)0x40039058))      // Synchronization (FTM1_SYNC)
#define FTM1_OUTINIT                  (*((volatile uint32_t *)0x4003905C))      // Initial State for Channels Output (FTM1_OUTINIT)
#define FTM1_OUTMASK                  (*((volatile uint32_t *)0x40039060))      // Output Mask (FTM1_OUTMASK)
#define FTM1_COMBINE                  (*((volatile uint32_t *)0x40039064))      // Function for Linked Channels (FTM1_COMBINE)
#define FTM1_DEADTIME                 (*((volatile uint32_t *)0x40039068))      // Deadtime Insertion Control (FTM1_DEADTIME)
#define FTM1_EXTTRIG                  (*((volatile uint32_t *)0x4003906C))      // FTM External Trigger (FTM1_EXTTRIG)
#define FTM1_POL                      (*((volatile uint32_t *)0x40039070))      // Channels Polarity (FTM1_POL)
#define FTM1_FMS                      (*((volatile uint32_t *)0x40039074))      // Fault Mode Status (FTM1_FMS)
#define FTM1_FILTER                   (*((volatile uint32_t *)0x40039078))      // Input Capture Filter Control (FTM1_FILTER)
#define FTM1_FLTCTRL                  (*((volatile uint32_t *)0x4003907C))      // Fault Control (FTM1_FLTCTRL)
#define FTM1_QDCTRL                   (*((volatile uint32_t *)0x40039080))      // Quadrature Decoder Control and Status (FTM1_QDCTRL)
#define FTM1_CONF                     (*((volatile uint32_t *)0x40039084))      // Configuration (FTM1_CONF)
#define FTM1_FLTPOL                   (*((volatile uint32_t *)0x40039088))      // FTM Fault Input Polarity (FTM1_FLTPOL)
#define FTM1_SYNCONF                  (*((volatile uint32_t *)0x4003908C))      // Synchronization Configuration (FTM1_SYNCONF)
#define FTM1_INVCTRL                  (*((volatile uint32_t *)0x40039090))      // FTM Inverting Control (FTM1_INVCTRL)
#define FTM1_SWOCTRL                  (*((volatile uint32_t *)0x40039094))      // FTM Software Output Control (FTM1_SWOCTRL)
#define FTM1_PWMLOAD                  (*((volatile uint32_t *)0x40039098))      // FTM PWM Load (FTM1_PWMLOAD)
#define FTM2_SC                       (*((volatile uint32_t *)0x400B8000))      // Status and Control (FTM2_SC)
#define FTM2_CNT                      (*((volatile uint32_t *)0x400B8004))      // Counter (FTM2_CNT)
#define FTM2_MOD                      (*((volatile uint32_t *)0x400B8008))      // Modulo (FTM2_MOD)
#define FTM2_C0SC                     (*((volatile uint32_t *)0x400B800C))      // Channel (n) Status and Control (FTM2_C0SC)
#define FTM2_C0V                      (*((volatile uint32_t *)0x400B8010))      // Channel (n) Value (FTM2_C0V)
#define FTM2_C1SC                     (*((volatile uint32_t *)0x400B8014))      // Channel (n) Status and Control (FTM2_C1SC)
#define FTM2_C1V                      (*((volatile uint32_t *)0x400B8018))      // Channel (n) Value (FTM2_C1V)
#define FTM2_C2SC                     (*((volatile uint32_t *)0x400B801C))      // Channel (n) Status and Control (FTM2_C2SC)
#define FTM2_C2V                      (*((volatile uint32_t *)0x400B8020))      // Channel (n) Value (FTM2_C2V)
#define FTM2_C3SC                     (*((volatile uint32_t *)0x400B8024))      // Channel (n) Status and Control (FTM2_C3SC)
#define FTM2_C3V                      (*((volatile uint32_t *)0x400B8028))      // Channel (n) Value (FTM2_C3V)
#define FTM2_C4SC                     (*((volatile uint32_t *)0x400B802C))      // Channel (n) Status and Control (FTM2_C4SC)
#define FTM2_C4V                      (*((volatile uint32_t *)0x400B8030))      // Channel (n) Value (FTM2_C4V)
#define FTM2_C5SC                     (*((volatile uint32_t *)0x400B8034))      // Channel (n) Status and Control (FTM2_C5SC)
#define FTM2_C5V                      (*((volatile uint32_t *)0x400B8038))      // Channel (n) Value (FTM2_C5V)
#define FTM2_C6SC                     (*((volatile uint32_t *)0x400B803C))      // Channel (n) Status and Control (FTM2_C6SC)
#define FTM2_C6V                      (*((volatile uint32_t *)0x400B8040))      // Channel (n) Value (FTM2_C6V)
#define FTM2_C7SC                     (*((volatile uint32_t *)0x400B8044))      // Channel (n) Status and Control (FTM2_C7SC)
#define FTM2_C7V                      (*((volatile uint32_t *)0x400B8048))      // Channel (n) Value (FTM2_C7V)
#define FTM2_CNTIN                    (*((volatile uint32_t *)0x400B804C))      // Counter Initial Value (FTM2_CNTIN)
#define FTM2_STATUS                   (*((volatile uint32_t *)0x400B8050))      // Capture and Compare Status (FTM2_STATUS)
#define FTM2_MODE                     (*((volatile uint32_t *)0x400B8054))      // Features Mode Selection (FTM2_MODE)
#define FTM2_SYNC                     (*((volatile uint32_t *)0x400B8058))      // Synchronization (FTM2_SYNC)
#define FTM2_OUTINIT                  (*((volatile uint32_t *)0x400B805C))      // Initial State for Channels Output (FTM2_OUTINIT)
#define FTM2_OUTMASK                  (*((volatile uint32_t *)0x400B8060))      // Output Mask (FTM2_OUTMASK)
#define FTM2_COMBINE                  (*((volatile uint32_t *)0x400B8064))      // Function for Linked Channels (FTM2_COMBINE)
#define FTM2_DEADTIME                 (*((volatile uint32_t *)0x400B8068))      // Deadtime Insertion Control (FTM2_DEADTIME)
#define FTM2_EXTTRIG                  (*((volatile uint32_t *)0x400B806C))      // FTM External Trigger (FTM2_EXTTRIG)
#define FTM2_POL                      (*((volatile uint32_t *)0x400B8070))      // Channels Polarity (FTM2_POL)
#define FTM2_FMS                      (*((volatile uint32_t *)0x400B8074))      // Fault Mode Status (FTM2_FMS)
#define FTM2_FILTER                   (*((volatile uint32_t *)0x400B8078))      // Input Capture Filter Control (FTM2_FILTER)
#define FTM2_FLTCTRL                  (*((volatile uint32_t *)0x400B807C))      // Fault Control (FTM2_FLTCTRL)
#define FTM2_QDCTRL                   (*((volatile uint32_t *)0x400B8080))      // Quadrature Decoder Control and Status (FTM2_QDCTRL)
#define FTM2_CONF                     (*((volatile uint32_t *)0x400B8084))      // Configuration (FTM2_CONF)
#define FTM2_FLTPOL                   (*((volatile uint32_t *)0x400B8088))      // FTM Fault Input Polarity (FTM2_FLTPOL)
#define FTM2_SYNCONF                  (*((volatile uint32_t *)0x400B808C))      // Synchronization Configuration (FTM2_SYNCONF)
#define FTM2_INVCTRL                  (*((volatile uint32_t *)0x400B8090))      // FTM Inverting Control (FTM2_INVCTRL)
#define FTM2_SWOCTRL                  (*((volatile uint32_t *)0x400B8094))      // FTM Software Output Control (FTM2_SWOCTRL)
#define FTM2_PWMLOAD                  (*((volatile uint32_t *)0x400B8098))      // FTM PWM Load (FTM2_PWMLOAD)


//*****************************************************************************
//
// Periodic Interrupt Timer (PIT) registers
//
//*****************************************************************************

#define PIT_MCR                       (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register (PIT_MCR)
#define PIT_LDVAL0                    (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register (PIT_LDVAL0)
#define PIT_CVAL0                     (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register (PIT_CVAL0)
#define PIT_TCTRL0                    (*((volatile uint32_t *)0x40037108))      // Timer Control Register (PIT_TCTRL0)
#define PIT_TFLG0                     (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register (PIT_TFLG0)
#define PIT_LDVAL1                    (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register (PIT_LDVAL1)
#define PIT_CVAL1                     (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register (PIT_CVAL1)
#define PIT_TCTRL1                    (*((volatile uint32_t *)0x40037118))      // Timer Control Register (PIT_TCTRL1)
#define PIT_TFLG1                     (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register (PIT_TFLG1)
#define PIT_LDVAL2                    (*((volatile uint32_t *)0x40037120))      // Timer Load Value Register (PIT_LDVAL2)
#define PIT_CVAL2                     (*((volatile uint32_t *)0x40037124))      // Current Timer Value Register (PIT_CVAL2)
#define PIT_TCTRL2                    (*((volatile uint32_t *)0x40037128))      // Timer Control Register (PIT_TCTRL2)
#define PIT_TFLG2                     (*((volatile uint32_t *)0x4003712C))      // Timer Flag Register (PIT_TFLG2)
#define PIT_LDVAL3                    (*((volatile uint32_t *)0x40037130))      // Timer Load Value Register (PIT_LDVAL3)
#define PIT_CVAL3                     (*((volatile uint32_t *)0x40037134))      // Current Timer Value Register (PIT_CVAL3)
#define PIT_TCTRL3                    (*((volatile uint32_t *)0x40037138))      // Timer Control Register (PIT_TCTRL3)
#define PIT_TFLG3                     (*((volatile uint32_t *)0x4003713C))      // Timer Flag Register (PIT_TFLG3)


//*****************************************************************************
//
// Low power timer (LPTMR) registers
//
//*****************************************************************************

