MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DX256ZVMD10/mcu.h
#define UART0_BDH                     (*((volatile uint32_t *)0x4006A000))      // UART Baud Rate Registers:High (UART0_BDH)
#define UART0_BDL                     (*((volatile uint32_t *)0x4006A001))      // UART Baud Rate Registers: Low (UART0_BDL)
#define UART0_C1                      (*((volatile uint32_t *)0x4006A002))      // UART Control Register 1 (UART0_C1)
#define UART0_C2                      (*((volatile uint32_t *)0x4006A003))      // UART Control Register 2 (UART0_C2)
#define UART0_S1                      (*((volatile uint32_t *)0x4006A004))      // UART Status Register 1 (UART0_S1)
#define UART0_S2                      (*((volatile uint32_t *)0x4006A005))      // UART Status Register 2 (UART0_S2)
#define UART0_C3                      (*((volatile uint32_t *)0x4006A006))      // UART Control Register 3 (UART0_C3)
#define UART0_D                       (*((volatile uint32_t *)0x4006A007))      // UART Data Register (UART0_D)
#define UART0_MA1                     (*((volatile uint32_t *)0x4006A008))      // UART Match Address Registers 1 (UART0_MA1)
#define UART0_MA2                     (*((volatile uint32_t *)0x4006A009))      // UART Match Address Registers 2 (UART0_MA2)
#define UART0_C4                      (*((volatile uint32_t *)0x4006A00A))      // UART Control Register 4 (UART0_C4)
#define UART0_C5                      (*((volatile uint32_t *)0x4006A00B))      // UART Control Register 5 (UART0_C5)
#define UART0_ED                      (*((volatile uint32_t *)0x4006A00C))      // UART Extended Data Register (UART0_ED)
#define UART0_MODEM                   (*((volatile uint32_t *)0x4006A00D))      // UART Modem Register (UART0_MODEM)
#define UART0_IR                      (*((volatile uint32_t *)0x4006A00E))      // UART Infrared Register (UART0_IR)
#define UART0_PFIFO                   (*((volatile uint32_t *)0x4006A010))      // UART FIFO Parameters (UART0_PFIFO)
#define UART0_CFIFO                   (*((volatile uint32_t *)0x4006A011))      // UART FIFO Control Register (UART0_CFIFO)
#define UART0_SFIFO                   (*((volatile uint32_t *)0x4006A012))      // UART FIFO Status Register (UART0_SFIFO)
#define UART0_TWFIFO                  (*((volatile uint32_t *)0x4006A013))      // UART FIFO Transmit Watermark (UART0_TWFIFO)
#define UART0_TCFIFO                  (*((volatile uint32_t *)0x4006A014))      // UART FIFO Transmit Count (UART0_TCFIFO)
#define UART0_RWFIFO                  (*((volatile uint32_t *)0x4006A015))      // UART FIFO Receive Watermark (UART0_RWFIFO)
#define UART0_RCFIFO                  (*((volatile uint32_t *)0x4006A016))      // UART FIFO Receive Count (UART0_RCFIFO)
#define UART0_C7816                   (*((volatile uint32_t *)0x4006A018))      // UART 7816 Control Register (UART0_C7816)
#define UART0_IE7816                  (*((volatile uint32_t *)0x4006A019))      // UART 7816 Interrupt Enable Register (UART0_IE7816)
#define UART0_IS7816                  (*((volatile uint32_t *)0x4006A01A))      // UART 7816 Interrupt Status Register (UART0_IS7816)
#define UART0_WP7816T0                (*((volatile uint32_t *)0x4006A01B))      // UART 7816 Wait Parameter Register (UART0_WP7816T0)
#define UART0_WP7816T1                (*((volatile uint32_t *)0x4006A01B))      // UART 7816 Wait Parameter Register (UART0_WP7816T1)
#define UART0_WN7816                  (*((volatile uint32_t *)0x4006A01C))      // UART 7816 Wait N Register (UART0_WN7816)
#define UART0_WF7816                  (*((volatile uint32_t *)0x4006A01D))      // UART 7816 Wait FD Register (UART0_WF7816)
#define UART0_ET7816                  (*((volatile uint32_t *)0x4006A01E))      // UART 7816 Error Threshold Register (UART0_ET7816)
#define UART0_TL7816                  (*((volatile uint32_t *)0x4006A01F))      // UART 7816 Transmit Length Register (UART0_TL7816)
#define UART1_BDH                     (*((volatile uint32_t *)0x4006B000))      // UART Baud Rate Registers:High (UART1_BDH)
#define UART1_BDL                     (*((volatile uint32_t *)0x4006B001))      // UART Baud Rate Registers: Low (UART1_BDL)
#define UART1_C1                      (*((volatile uint32_t *)0x4006B002))      // UART Control Register 1 (UART1_C1)
#define UART1_C2                      (*((volatile uint32_t *)0x4006B003))      // UART Control Register 2 (UART1_C2)
#define UART1_S1                      (*((volatile uint32_t *)0x4006B004))      // UART Status Register 1 (UART1_S1)
#define UART1_S2                      (*((volatile uint32_t *)0x4006B005))      // UART Status Register 2 (UART1_S2)
#define UART1_C3                      (*((volatile uint32_t *)0x4006B006))      // UART Control Register 3 (UART1_C3)
#define UART1_D                       (*((volatile uint32_t *)0x4006B007))      // UART Data Register (UART1_D)
#define UART1_MA1                     (*((volatile uint32_t *)0x4006B008))      // UART Match Address Registers 1 (UART1_MA1)
#define UART1_MA2                     (*((volatile uint32_t *)0x4006B009))      // UART Match Address Registers 2 (UART1_MA2)
#define UART1_C4                      (*((volatile uint32_t *)0x4006B00A))      // UART Control Register 4 (UART1_C4)
#define UART1_C5                      (*((volatile uint32_t *)0x4006B00B))      // UART Control Register 5 (UART1_C5)
#define UART1_ED                      (*((volatile uint32_t *)0x4006B00C))      // UART Extended Data Register (UART1_ED)
#define UART1_MODEM                   (*((volatile uint32_t *)0x4006B00D))      // UART Modem Register (UART1_MODEM)
#define UART1_IR                      (*((volatile uint32_t *)0x4006B00E))      // UART Infrared Register (UART1_IR)
#define UART1_PFIFO                   (*((volatile uint32_t *)0x4006B010))      // UART FIFO Parameters (UART1_PFIFO)
#define UART1_CFIFO                   (*((volatile uint32_t *)0x4006B011))      // UART FIFO Control Register (UART1_CFIFO)
#define UART1_SFIFO                   (*((volatile uint32_t *)0x4006B012))      // UART FIFO Status Register (UART1_SFIFO)
#define UART1_TWFIFO                  (*((volatile uint32_t *)0x4006B013))      // UART FIFO Transmit Watermark (UART1_TWFIFO)
#define UART1_TCFIFO                  (*((volatile uint32_t *)0x4006B014))      // UART FIFO Transmit Count (UART1_TCFIFO)
#define UART1_RWFIFO                  (*((volatile uint32_t *)0x4006B015))      // UART FIFO Receive Watermark (UART1_RWFIFO)
#define UART1_RCFIFO                  (*((volatile uint32_t *)0x4006B016))      // UART FIFO Receive Count (UART1_RCFIFO)
#define UART1_C7816                   (*((volatile uint32_t *)0x4006B018))      // UART 7816 Control Register (UART1_C7816)
#define UART1_IE7816                  (*((volatile uint32_t *)0x4006B019))      // UART 7816 Interrupt Enable Register (UART1_IE7816)
#define UART1_IS7816                  (*((volatile uint32_t *)0x4006B01A))      // UART 7816 Interrupt Status Register (UART1_IS7816)
#define UART1_WP7816T0                (*((volatile uint32_t *)0x4006B01B))      // UART 7816 Wait Parameter Register (UART1_WP7816T0)
#define UART1_WP7816T1                (*((volatile uint32_t *)0x4006B01B))      // UART 7816 Wait Parameter Register (UART1_WP7816T1)
#define UART1_WN7816                  (*((volatile uint32_t *)0x4006B01C))      // UART 7816 Wait N Register (UART1_WN7816)
#define UART1_WF7816                  (*((volatile uint32_t *)0x4006B01D))      // UART 7816 Wait FD Register (UART1_WF7816)
#define UART1_ET7816                  (*((volatile uint32_t *)0x4006B01E))      // UART 7816 Error Threshold Register (UART1_ET7816)
#define UART1_TL7816                  (*((volatile uint32_t *)0x4006B01F))      // UART 7816 Transmit Length Register (UART1_TL7816)
#define UART2_BDH                     (*((volatile uint32_t *)0x4006C000))      // UART Baud Rate Registers:High (UART2_BDH)
#define UART2_BDL                     (*((volatile uint32_t *)0x4006C001))      // UART Baud Rate Registers: Low (UART2_BDL)
#define UART2_C1                      (*((volatile uint32_t *)0x4006C002))      // UART Control Register 1 (UART2_C1)
#define UART2_C2                      (*((volatile uint32_t *)0x4006C003))      // UART Control Register 2 (UART2_C2)
#define UART2_S1                      (*((volatile uint32_t *)0x4006C004))      // UART Status Register 1 (UART2_S1)
#define UART2_S2                      (*((volatile uint32_t *)0x4006C005))      // UART Status Register 2 (UART2_S2)
#define UART2_C3                      (*((volatile uint32_t *)0x4006C006))      // UART Control Register 3 (UART2_C3)
#define UART2_D                       (*((volatile uint32_t *)0x4006C007))      // UART Data Register (UART2_D)
#define UART2_MA1                     (*((volatile uint32_t *)0x4006C008))      // UART Match Address Registers 1 (UART2_MA1)
#define UART2_MA2                     (*((volatile uint32_t *)0x4006C009))      // UART Match Address Registers 2 (UART2_MA2)
#define UART2_C4                      (*((volatile uint32_t *)0x4006C00A))      // UART Control Register 4 (UART2_C4)
#define UART2_C5                      (*((volatile uint32_t *)0x4006C00B))      // UART Control Register 5 (UART2_C5)
#define UART2_ED                      (*((volatile uint32_t *)0x4006C00C))      // UART Extended Data Register (UART2_ED)
#define UART2_MODEM                   (*((volatile uint32_t *)0x4006C00D))      // UART Modem Register (UART2_MODEM)
#define UART2_IR                      (*((volatile uint32_t *)0x4006C00E))      // UART Infrared Register (UART2_IR)
#define UART2_PFIFO                   (*((volatile uint32_t *)0x4006C010))      // UART FIFO Parameters (UART2_PFIFO)
#define UART2_CFIFO                   (*((volatile uint32_t *)0x4006C011))      // UART FIFO Control Register (UART2_CFIFO)
#define UART2_SFIFO                   (*((volatile uint32_t *)0x4006C012))      // UART FIFO Status Register (UART2_SFIFO)
#define UART2_TWFIFO                  (*((volatile uint32_t *)0x4006C013))      // UART FIFO Transmit Watermark (UART2_TWFIFO)
#define UART2_TCFIFO                  (*((volatile uint32_t *)0x4006C014))      // UART FIFO Transmit Count (UART2_TCFIFO)
#define UART2_RWFIFO                  (*((volatile uint32_t *)0x4006C015))      // UART FIFO Receive Watermark (UART2_RWFIFO)
#define UART2_RCFIFO                  (*((volatile uint32_t *)0x4006C016))      // UART FIFO Receive Count (UART2_RCFIFO)
#define UART2_C7816                   (*((volatile uint32_t *)0x4006C018))      // UART 7816 Control Register (UART2_C7816)
#define UART2_IE7816                  (*((volatile uint32_t *)0x4006C019))      // UART 7816 Interrupt Enable Register (UART2_IE7816)
#define UART2_IS7816                  (*((volatile uint32_t *)0x4006C01A))      // UART 7816 Interrupt Status Register (UART2_IS7816)
#define UART2_WP7816T0                (*((volatile uint32_t *)0x4006C01B))      // UART 7816 Wait Parameter Register (UART2_WP7816T0)
#define UART2_WP7816T1                (*((volatile uint32_t *)0x4006C01B))      // UART 7816 Wait Parameter Register (UART2_WP7816T1)
#define UART2_WN7816                  (*((volatile uint32_t *)0x4006C01C))      // UART 7816 Wait N Register (UART2_WN7816)
#define UART2_WF7816                  (*((volatile uint32_t *)0x4006C01D))      // UART 7816 Wait FD Register (UART2_WF7816)
#define UART2_ET7816                  (*((volatile uint32_t *)0x4006C01E))      // UART 7816 Error Threshold Register (UART2_ET7816)
#define UART2_TL7816                  (*((volatile uint32_t *)0x4006C01F))      // UART 7816 Transmit Length Register (UART2_TL7816)
#define UART3_BDH                     (*((volatile uint32_t *)0x4006D000))      // UART Baud Rate Registers:High (UART3_BDH)
#define UART3_BDL                     (*((volatile uint32_t *)0x4006D001))      // UART Baud Rate Registers: Low (UART3_BDL)
#define UART3_C1                      (*((volatile uint32_t *)0x4006D002))      // UART Control Register 1 (UART3_C1)
#define UART3_C2                      (*((volatile uint32_t *)0x4006D003))      // UART Control Register 2 (UART3_C2)
#define UART3_S1                      (*((volatile uint32_t *)0x4006D004))      // UART Status Register 1 (UART3_S1)
#define UART3_S2                      (*((volatile uint32_t *)0x4006D005))      // UART Status Register 2 (UART3_S2)
#define UART3_C3                      (*((volatile uint32_t *)0x4006D006))      // UART Control Register 3 (UART3_C3)
#define UART3_D                       (*((volatile uint32_t *)0x4006D007))      // UART Data Register (UART3_D)
#define UART3_MA1                     (*((volatile uint32_t *)0x4006D008))      // UART Match Address Registers 1 (UART3_MA1)
#define UART3_MA2                     (*((volatile uint32_t *)0x4006D009))      // UART Match Address Registers 2 (UART3_MA2)
#define UART3_C4                      (*((volatile uint32_t *)0x4006D00A))      // UART Control Register 4 (UART3_C4)
#define UART3_C5                      (*((volatile uint32_t *)0x4006D00B))      // UART Control Register 5 (UART3_C5)
#define UART3_ED                      (*((volatile uint32_t *)0x4006D00C))      // UART Extended Data Register (UART3_ED)
#define UART3_MODEM                   (*((volatile uint32_t *)0x4006D00D))      // UART Modem Register (UART3_MODEM)
#define UART3_IR                      (*((volatile uint32_t *)0x4006D00E))      // UART Infrared Register (UART3_IR)
#define UART3_PFIFO                   (*((volatile uint32_t *)0x4006D010))      // UART FIFO Parameters (UART3_PFIFO)
#define UART3_CFIFO                   (*((volatile uint32_t *)0x4006D011))      // UART FIFO Control Register (UART3_CFIFO)
#define UART3_SFIFO                   (*((volatile uint32_t *)0x4006D012))      // UART FIFO Status Register (UART3_SFIFO)
#define UART3_TWFIFO                  (*((volatile uint32_t *)0x4006D013))      // UART FIFO Transmit Watermark (UART3_TWFIFO)
#define UART3_TCFIFO                  (*((volatile uint32_t *)0x4006D014))      // UART FIFO Transmit Count (UART3_TCFIFO)
#define UART3_RWFIFO                  (*((volatile uint32_t *)0x4006D015))      // UART FIFO Receive Watermark (UART3_RWFIFO)
#define UART3_RCFIFO                  (*((volatile uint32_t *)0x4006D016))      // UART FIFO Receive Count (UART3_RCFIFO)
#define UART3_C7816                   (*((volatile uint32_t *)0x4006D018))      // UART 7816 Control Register (UART3_C7816)
#define UART3_IE7816                  (*((volatile uint32_t *)0x4006D019))      // UART 7816 Interrupt Enable Register (UART3_IE7816)
#define UART3_IS7816                  (*((volatile uint32_t *)0x4006D01A))      // UART 7816 Interrupt Status Register (UART3_IS7816)
#define UART3_WP7816T0                (*((volatile uint32_t *)0x4006D01B))      // UART 7816 Wait Parameter Register (UART3_WP7816T0)
#define UART3_WP7816T1                (*((volatile uint32_t *)0x4006D01B))      // UART 7816 Wait Parameter Register (UART3_WP7816T1)
#define UART3_WN7816                  (*((volatile uint32_t *)0x4006D01C))      // UART 7816 Wait N Register (UART3_WN7816)
#define UART3_WF7816                  (*((volatile uint32_t *)0x4006D01D))      // UART 7816 Wait FD Register (UART3_WF7816)
#define UART3_ET7816                  (*((volatile uint32_t *)0x4006D01E))      // UART 7816 Error Threshold Register (UART3_ET7816)
#define UART3_TL7816                  (*((volatile uint32_t *)0x4006D01F))      // UART 7816 Transmit Length Register (UART3_TL7816)
#define UART4_BDH                     (*((volatile uint32_t *)0x400EA000))      // UART Baud Rate Registers:High (UART4_BDH)
#define UART4_BDL                     (*((volatile uint32_t *)0x400EA001))      // UART Baud Rate Registers: Low (UART4_BDL)
#define UART4_C1                      (*((volatile uint32_t *)0x400EA002))      // UART Control Register 1 (UART4_C1)
#define UART4_C2                      (*((volatile uint32_t *)0x400EA003))      // UART Control Register 2 (UART4_C2)
#define UART4_S1                      (*((volatile uint32_t *)0x400EA004))      // UART Status Register 1 (UART4_S1)
#define UART4_S2                      (*((volatile uint32_t *)0x400EA005))      // UART Status Register 2 (UART4_S2)
#define UART4_C3                      (*((volatile uint32_t *)0x400EA006))      // UART Control Register 3 (UART4_C3)
#define UART4_D                       (*((volatile uint32_t *)0x400EA007))      // UART Data Register (UART4_D)
#define UART4_MA1                     (*((volatile uint32_t *)0x400EA008))      // UART Match Address Registers 1 (UART4_MA1)
#define UART4_MA2                     (*((volatile uint32_t *)0x400EA009))      // UART Match Address Registers 2 (UART4_MA2)
#define UART4_C4                      (*((volatile uint32_t *)0x400EA00A))      // UART Control Register 4 (UART4_C4)
#define UART4_C5                      (*((volatile uint32_t *)0x400EA00B))      // UART Control Register 5 (UART4_C5)
#define UART4_ED                      (*((volatile uint32_t *)0x400EA00C))      // UART Extended Data Register (UART4_ED)
#define UART4_MODEM                   (*((volatile uint32_t *)0x400EA00D))      // UART Modem Register (UART4_MODEM)
#define UART4_IR                      (*((volatile uint32_t *)0x400EA00E))      // UART Infrared Register (UART4_IR)
#define UART4_PFIFO                   (*((volatile uint32_t *)0x400EA010))      // UART FIFO Parameters (UART4_PFIFO)
#define UART4_CFIFO                   (*((volatile uint32_t *)0x400EA011))      // UART FIFO Control Register (UART4_CFIFO)
#define UART4_SFIFO                   (*((volatile uint32_t *)0x400EA012))      // UART FIFO Status Register (UART4_SFIFO)
#define UART4_TWFIFO                  (*((volatile uint32_t *)0x400EA013))      // UART FIFO Transmit Watermark (UART4_TWFIFO)
#define UART4_TCFIFO                  (*((volatile uint32_t *)0x400EA014))      // UART FIFO Transmit Count (UART4_TCFIFO)
#define UART4_RWFIFO                  (*((volatile uint32_t *)0x400EA015))      // UART FIFO Receive Watermark (UART4_RWFIFO)
#define UART4_RCFIFO                  (*((volatile uint32_t *)0x400EA016))      // UART FIFO Receive Count (UART4_RCFIFO)
#define UART4_C7816                   (*((volatile uint32_t *)0x400EA018))      // UART 7816 Control Register (UART4_C7816)
#define UART4_IE7816                  (*((volatile uint32_t *)0x400EA019))      // UART 7816 Interrupt Enable Register (UART4_IE7816)
#define UART4_IS7816                  (*((volatile uint32_t *)0x400EA01A))      // UART 7816 Interrupt Status Register (UART4_IS7816)
#define UART4_WP7816T0                (*((volatile uint32_t *)0x400EA01B))      // UART 7816 Wait Parameter Register (UART4_WP7816T0)
#define UART4_WP7816T1                (*((volatile uint32_t *)0x400EA01B))      // UART 7816 Wait Parameter Register (UART4_WP7816T1)
#define UART4_WN7816                  (*((volatile uint32_t *)0x400EA01C))      // UART 7816 Wait N Register (UART4_WN7816)
#define UART4_WF7816                  (*((volatile uint32_t *)0x400EA01D))      // UART 7816 Wait FD Register (UART4_WF7816)
#define UART4_ET7816                  (*((volatile uint32_t *)0x400EA01E))      // UART 7816 Error Threshold Register (UART4_ET7816)
#define UART4_TL7816                  (*((volatile uint32_t *)0x400EA01F))      // UART 7816 Transmit Length Register (UART4_TL7816)
#define UART5_BDH                     (*((volatile uint32_t *)0x400EB000))      // UART Baud Rate Registers:High (UART5_BDH)
#define UART5_BDL                     (*((volatile uint32_t *)0x400EB001))      // UART Baud Rate Registers: Low (UART5_BDL)
#define UART5_C1                      (*((volatile uint32_t *)0x400EB002))      // UART Control Register 1 (UART5_C1)
#define UART5_C2                      (*((volatile uint32_t *)0x400EB003))      // UART Control Register 2 (UART5_C2)
#define UART5_S1                      (*((volatile uint32_t *)0x400EB004))      // UART Status Register 1 (UART5_S1)
#define UART5_S2                      (*((volatile uint32_t *)0x400EB005))      // UART Status Register 2 (UART5_S2)
#define UART5_C3                      (*((volatile uint32_t *)0x400EB006))      // UART Control Register 3 (UART5_C3)
#define UART5_D                       (*((volatile uint32_t *)0x400EB007))      // UART Data Register (UART5_D)
#define UART5_MA1                     (*((volatile uint32_t *)0x400EB008))      // UART Match Address Registers 1 (UART5_MA1)
#define UART5_MA2                     (*((volatile uint32_t *)0x400EB009))      // UART Match Address Registers 2 (UART5_MA2)
#define UART5_C4                      (*((volatile uint32_t *)0x400EB00A))      // UART Control Register 4 (UART5_C4)
#define UART5_C5                      (*((volatile uint32_t *)0x400EB00B))      // UART Control Register 5 (UART5_C5)
#define UART5_ED                      (*((volatile uint32_t *)0x400EB00C))      // UART Extended Data Register (UART5_ED)
#define UART5_MODEM                   (*((volatile uint32_t *)0x400EB00D))      // UART Modem Register (UART5_MODEM)
#define UART5_IR                      (*((volatile uint32_t *)0x400EB00E))      // UART Infrared Register (UART5_IR)
#define UART5_PFIFO                   (*((volatile uint32_t *)0x400EB010))      // UART FIFO Parameters (UART5_PFIFO)
#define UART5_CFIFO                   (*((volatile uint32_t *)0x400EB011))      // UART FIFO Control Register (UART5_CFIFO)
#define UART5_SFIFO                   (*((volatile uint32_t *)0x400EB012))      // UART FIFO Status Register (UART5_SFIFO)


//*****************************************************************************
//
// Secured digital host controller (SDHC) registers
//
//*****************************************************************************

