MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DX256ZVMD10/mcu.h
#define BABR                          0x40000000      // BABR interrupt mask
#define BABT                          0x20000000      // BABT interrupt mask
#define GRA                           0x10000000      // GRA interrupt mask
#define TXF                           0x08000000      // TXF interrupt mask
#define TXB                           0x04000000      // TXB interrupt mask
#define RXF                           0x02000000      // RXF interrupt mask
#define RXB                           0x01000000      // RXB interrupt mask
#define MII                           0x00800000      // MII interrupt mask
#define EBERR                         0x00400000      // EBERR interrupt mask
#define LC                            0x00200000      // LC interrupt mask
#define RL                            0x00100000      // RL interrupt mask
#define UN                            0x00080000      // UN interrupt mask
#define PLR                           0x00040000      // PLR interrupt mask
#define WAKEUP                        0x00020000      // WAKEUP interrupt mask
#define TS_AVAIL                      0x00010000      // TS_AVAIL interrupt mask
#define TS_TIMER                      0x00008000      // TS_TIMER interrupt mask


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RDAR register.
//
//*****************************************************************************

#define RDAR                          0x01000000      // Receive descriptor active


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TDAR register.
//
//*****************************************************************************

#define TDAR                          0x01000000      // Transmit descriptor active


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ECR register.
//
//*****************************************************************************

#define STOPEN                        0x00000080      // STOPEN Signal Control
#define DBGEN                         0x00000040      // Debug enable
#define EN1588                        0x00000020      // EN1588 enable
#define SLEEP                         0x00000008      // Sleep mode enable
#define MAGICEN                       0x00000004      // Magic packet detection enable
#define ETHEREN                       0x00000002      // Ethernet enable
#define RESET                         0x00000001      // Ethernet MAC reset


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MMFR register.
//
//*****************************************************************************

#define ST                            0x180000000      // Start of frame delimiter
#define OP                            0x60000000      // Operation code
#define PA                            0xF8000000      // PHY address
#define RA                            0x07C00000      // Register address
#define TA                            0x00060000      // Turn around
#define DATA                          0x7FFF8000      // Management frame data


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MSCR register.
//
//*****************************************************************************

#define HOLDTIME                      0x00001C00      // Holdtime on MDIO output
#define DIS_PRE                       0x00000080      // Disable preamble
#define MII_SPEED                     0x00000FC0      // MII speed


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_MIBC register.
//
//*****************************************************************************

#define MIB_DIS                       0x80000000      // Disable MIB logic
#define MIB_IDLE                      0x40000000      // MIB idle
#define MIB_CLEAR                     0x20000000      // MIB clear


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RCR register.
//
//*****************************************************************************

#define GRS                           0x80000000      // Graceful receive stopped
#define NLC                           0x40000000      // Payload length check disable
#define MAX_FL                        0x7FFE0000000      // Maximum frame length
#define CFEN                          0x00008000      // MAC control frame enable
#define CRCFWD                        0x00004000      // Terminate/forward received CRC
#define PAUFWD                        0x00002000      // Terminate/forward pause frames.
#define PADEN                         0x00001000      // Enable frame padding remove on receive
#define -                             0x00001800      // This read-only field is reserved and always has the value zero.
#define RMII_10T                      0x00000200      // Enables 10-Mbps mode of the RMII.
#define RMII_MODE                     0x00000100      // RMII mode enable
#define -                             0x00000080      // This read-only field is reserved and always has the value zero.
#define -                             0x00000040      // This read-only field is reserved and always has the value zero.
#define FCE                           0x00000020      // Flow control enable
#define BC_REJ                        0x00000010      // Broadcast frame reject
#define PROM                          0x00000008      // Promiscuous mode. All frames are accepted regardless of address matching.
#define MII_MODE                      0x00000004      // Media independent interface mode
#define DRT                           0x00000002      // Disable receive on transmit
#define LOOP                          0x00000001      // Internal loopback


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TCR register.
//
//*****************************************************************************

#define CRCFWD                        0x00000200      // Forward frame from application with CRC
#define ADDINS                        0x00000100      // Set MAC address on transmit
#define ADDSEL                        0x00000380      // Source MAC address select on transmit
#define RFC_PAUSE                     0x00000010      // Receive frame control pause
#define TFC_PAUSE                     0x00000008      // Transmit frame control pause
#define FDEN                          0x00000004      // Full duplex enable
#define -                             0x00000002      // This read-only field is reserved and always has the value zero.
#define GTS                           0x00000001      // Graceful transmit stop


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_PALR register.
//
//*****************************************************************************

#define PADDR1                        0x7FFFFFFF80000000      // Pause address


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_PAUR register.
//
//*****************************************************************************

